package com.itheima._01review;
/*
    修饰符 返回值类型 方法名(参数列表: 数据类型 变量名, 数据类型 变量名 ...) {
        方法体;
        return;
    }

    返回值类型: 使用了这个功能, 我能得到什么
    参数列表: 使用了这个功能, 我要提供什么

    1. 如果方法有明确的返回值类型, 必须使用return返回该类型的值
    2. 如果方法有明确的参数列表, 调用的时候必须传入该参数类型的值
    3. 如果方法有明确的返回值类型, 可以使用该类型来接收方法的调用
    4. return后面不能有代码

    方法的三种调用格式:
        1. 直接调用
        2. 赋值调用
        3. 输出语句调用

    方法的重载:
        在同一个类中, 方法名相同, 参数列表不同, 与返回值类型和修饰符无关


 */
public class Demo01_复习 {
    public static void main(String[] args) {

    }


}
